---
kind: method
id: M:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetSplitRefsOffsets
source: html/822d4846-4b23-2b0c-36cf-18dd002a4ba3.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetSplitRefsOffsets Method

Returns offsets for plane-defining splitters.

## Syntax (C#)
```csharp
public IDictionary<ElementId, double> GetSplitRefsOffsets()
```